def rectangle_area(a, b):
    '''
    Принимает два неотрицательных десятичных числа a и b и выводит значение (в десятичном формате),
    равное площади прямоугольника со сторонами длинами a и b
    '''
    return a * b

def rectangle_perimeter(a, b):
    '''
    Принимает два неотрицательных десятичных числа a и b и выводит значение (в десятичном формате),
    равное периметру прямоугольника со сторонами длинами a и b
    '''
    return (a + b) * 2

# a, b = 3.2, 11.45
# print(area(a, b))
# print(perimeter(a, b))